{"format": "graph-model", "generatedBy": "2.4.0", "convertedBy": "TensorFlow.js Converter v2.8.4", "signature": {"inputs": {"dense_6_input:0": {"name": "dense_6_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "100"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_37/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_37/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_37/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_37/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_37/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_37/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_37/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "1"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_36/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_36/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_36/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_36/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_36/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_36/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_36/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "8"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_35/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_35/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_35/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_35/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_35/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_35/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_35/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_34/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_34/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_34/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_34/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_34/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_34/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_34/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_33/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_33/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_33/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_33/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_33/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_33/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_33/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_32/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_32/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_32/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_32/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_32/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_32/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_32/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_31/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_31/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_31/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_31/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_31/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_31/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_31/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_30/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_30/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_30/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_30/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_30/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_30/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_30/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_29/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_29/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_29/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_29/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_29/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_29/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_29/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_28/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_28/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_28/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_28/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_28/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_28/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_28/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "256"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/dense_6/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "32768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_29/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_29/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/reshape_5/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/reshape_5/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/reshape_5/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/reshape_5/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/reshape_5/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/reshape_5/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_6_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "100"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_38/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_38/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_37/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_37/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_36/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_36/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_35/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_35/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_34/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_34/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_33/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_33/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_32/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_32/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_31/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_31/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_30/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_30/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/dense_6/MatMul", "op": "MatMul", "input": ["dense_6_input", "StatefulPartitionedCall/sequential_6/dense_6/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_29/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_6/dense_6/MatMul", "StatefulPartitionedCall/sequential_6/batch_normalization_29/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_29/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_29/batchnorm/mul_1", "StatefulPartitionedCall/sequential_6/batch_normalization_29/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/leaky_re_lu_35/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_29/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/sequential_6/reshape_5/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_6/leaky_re_lu_35/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/reshape_5/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_6/reshape_5/Shape", "StatefulPartitionedCall/sequential_6/reshape_5/strided_slice/stack", "StatefulPartitionedCall/sequential_6/reshape_5/strided_slice/stack_1", "StatefulPartitionedCall/sequential_6/reshape_5/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_6/reshape_5/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_6/reshape_5/strided_slice", "StatefulPartitionedCall/sequential_6/reshape_5/Reshape/shape/1", "StatefulPartitionedCall/sequential_6/reshape_5/Reshape/shape/2", "StatefulPartitionedCall/sequential_6/reshape_5/Reshape/shape/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/sequential_6/reshape_5/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_6/leaky_re_lu_35/LeakyRelu", "StatefulPartitionedCall/sequential_6/reshape_5/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_28/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_6/reshape_5/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_28/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_28/Shape", "StatefulPartitionedCall/sequential_6/conv2d_transpose_28/strided_slice/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_28/strided_slice/stack_1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_28/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_28/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_28/strided_slice", "StatefulPartitionedCall/sequential_6/conv2d_transpose_28/stack/1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_28/stack/2", "StatefulPartitionedCall/sequential_6/conv2d_transpose_28/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_28/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_28/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_28/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/sequential_6/reshape_5/Reshape"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_30/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_28/conv2d_transpose", "StatefulPartitionedCall/sequential_6/batch_normalization_30/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_30/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_30/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_6/batch_normalization_30/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/leaky_re_lu_36/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_30/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_29/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_6/leaky_re_lu_36/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_29/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_29/Shape", "StatefulPartitionedCall/sequential_6/conv2d_transpose_29/strided_slice/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_29/strided_slice/stack_1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_29/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_29/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_29/strided_slice", "StatefulPartitionedCall/sequential_6/conv2d_transpose_29/stack/1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_29/stack/2", "StatefulPartitionedCall/sequential_6/conv2d_transpose_29/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_29/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_29/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_29/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/sequential_6/leaky_re_lu_36/LeakyRelu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_31/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_29/conv2d_transpose", "StatefulPartitionedCall/sequential_6/batch_normalization_31/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_31/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_31/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_6/batch_normalization_31/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/leaky_re_lu_37/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_31/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_30/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_6/leaky_re_lu_37/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_30/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_30/Shape", "StatefulPartitionedCall/sequential_6/conv2d_transpose_30/strided_slice/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_30/strided_slice/stack_1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_30/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_30/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_30/strided_slice", "StatefulPartitionedCall/sequential_6/conv2d_transpose_30/stack/1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_30/stack/2", "StatefulPartitionedCall/sequential_6/conv2d_transpose_30/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_30/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_30/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_30/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/sequential_6/leaky_re_lu_37/LeakyRelu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_32/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_30/conv2d_transpose", "StatefulPartitionedCall/sequential_6/batch_normalization_32/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_32/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_32/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_6/batch_normalization_32/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/leaky_re_lu_38/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_32/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_31/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_6/leaky_re_lu_38/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_31/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_31/Shape", "StatefulPartitionedCall/sequential_6/conv2d_transpose_31/strided_slice/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_31/strided_slice/stack_1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_31/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_31/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_31/strided_slice", "StatefulPartitionedCall/sequential_6/conv2d_transpose_31/stack/1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_31/stack/2", "StatefulPartitionedCall/sequential_6/conv2d_transpose_31/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_31/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_31/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_31/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/sequential_6/leaky_re_lu_38/LeakyRelu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_33/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_31/conv2d_transpose", "StatefulPartitionedCall/sequential_6/batch_normalization_33/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_33/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_33/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_6/batch_normalization_33/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/leaky_re_lu_39/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_33/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_32/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_6/leaky_re_lu_39/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_32/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_32/Shape", "StatefulPartitionedCall/sequential_6/conv2d_transpose_32/strided_slice/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_32/strided_slice/stack_1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_32/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_32/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_32/strided_slice", "StatefulPartitionedCall/sequential_6/conv2d_transpose_32/stack/1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_32/stack/2", "StatefulPartitionedCall/sequential_6/conv2d_transpose_32/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_32/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_32/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_32/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/sequential_6/leaky_re_lu_39/LeakyRelu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_34/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_32/conv2d_transpose", "StatefulPartitionedCall/sequential_6/batch_normalization_34/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_34/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_34/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_6/batch_normalization_34/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/leaky_re_lu_40/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_34/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_33/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_6/leaky_re_lu_40/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_33/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_33/Shape", "StatefulPartitionedCall/sequential_6/conv2d_transpose_33/strided_slice/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_33/strided_slice/stack_1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_33/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_33/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_33/strided_slice", "StatefulPartitionedCall/sequential_6/conv2d_transpose_33/stack/1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_33/stack/2", "StatefulPartitionedCall/sequential_6/conv2d_transpose_33/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_33/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_33/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_33/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/sequential_6/leaky_re_lu_40/LeakyRelu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_35/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_33/conv2d_transpose", "StatefulPartitionedCall/sequential_6/batch_normalization_35/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_35/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_35/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_6/batch_normalization_35/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/leaky_re_lu_41/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_35/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_34/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_6/leaky_re_lu_41/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_34/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_34/Shape", "StatefulPartitionedCall/sequential_6/conv2d_transpose_34/strided_slice/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_34/strided_slice/stack_1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_34/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_34/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_34/strided_slice", "StatefulPartitionedCall/sequential_6/conv2d_transpose_34/stack/1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_34/stack/2", "StatefulPartitionedCall/sequential_6/conv2d_transpose_34/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_34/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_34/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_34/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/sequential_6/leaky_re_lu_41/LeakyRelu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_36/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_34/conv2d_transpose", "StatefulPartitionedCall/sequential_6/batch_normalization_36/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_36/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_36/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_6/batch_normalization_36/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/leaky_re_lu_42/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_36/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_35/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_6/leaky_re_lu_42/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_35/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_35/Shape", "StatefulPartitionedCall/sequential_6/conv2d_transpose_35/strided_slice/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_35/strided_slice/stack_1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_35/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_35/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_35/strided_slice", "StatefulPartitionedCall/sequential_6/conv2d_transpose_35/stack/1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_35/stack/2", "StatefulPartitionedCall/sequential_6/conv2d_transpose_35/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_35/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_35/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_35/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/sequential_6/leaky_re_lu_42/LeakyRelu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_37/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_35/conv2d_transpose", "StatefulPartitionedCall/sequential_6/batch_normalization_37/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_37/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_37/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_6/batch_normalization_37/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/leaky_re_lu_43/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_37/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_36/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_6/leaky_re_lu_43/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_36/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_36/Shape", "StatefulPartitionedCall/sequential_6/conv2d_transpose_36/strided_slice/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_36/strided_slice/stack_1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_36/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_36/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_36/strided_slice", "StatefulPartitionedCall/sequential_6/conv2d_transpose_36/stack/1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_36/stack/2", "StatefulPartitionedCall/sequential_6/conv2d_transpose_36/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_36/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_36/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_36/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/sequential_6/leaky_re_lu_43/LeakyRelu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_38/FusedBatchNormV3/Mul", "op": 