{"format": "graph-model", "generatedBy": "2.4.0", "convertedBy": "TensorFlow.js Converter v2.8.4", "signature": {"inputs": {"dense_6_input:0": {"name": "dense_6_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_27/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_27/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_27/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_27/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_27/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_27/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_27/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "1"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_26/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_26/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_26/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_26/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_26/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_26/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_26/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "8"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_25/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_25/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_25/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_25/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_25/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_25/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_25/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_24/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_24/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_24/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_24/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_24/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_24/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_24/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_23/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_23/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_23/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_23/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_23/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_23/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_23/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_22/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_22/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_22/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_22/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_22/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_22/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_22/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_21/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_21/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_21/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_21/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_21/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_21/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_21/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "256"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/dense_6/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "16384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_21/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_21/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/reshape_3/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/reshape_3/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/reshape_3/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/reshape_3/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/reshape_3/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/reshape_3/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_6_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "2"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_27/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_27/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_26/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_26/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_25/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_25/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_24/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_24/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_23/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_23/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_22/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_22/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/dense_6/MatMul", "op": "MatMul", "input": ["dense_6_input", "StatefulPartitionedCall/sequential_6/dense_6/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_21/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_6/dense_6/MatMul", "StatefulPartitionedCall/sequential_6/batch_normalization_21/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_21/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_21/batchnorm/mul_1", "StatefulPartitionedCall/sequential_6/batch_normalization_21/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/leaky_re_lu_39/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_21/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/sequential_6/reshape_3/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_6/leaky_re_lu_39/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/reshape_3/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_6/reshape_3/Shape", "StatefulPartitionedCall/sequential_6/reshape_3/strided_slice/stack", "StatefulPartitionedCall/sequential_6/reshape_3/strided_slice/stack_1", "StatefulPartitionedCall/sequential_6/reshape_3/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_6/reshape_3/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_6/reshape_3/strided_slice", "StatefulPartitionedCall/sequential_6/reshape_3/Reshape/shape/1", "StatefulPartitionedCall/sequential_6/reshape_3/Reshape/shape/2", "StatefulPartitionedCall/sequential_6/reshape_3/Reshape/shape/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/sequential_6/reshape_3/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_6/leaky_re_lu_39/LeakyRelu", "StatefulPartitionedCall/sequential_6/reshape_3/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_21/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_6/reshape_3/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_21/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_21/Shape", "StatefulPartitionedCall/sequential_6/conv2d_transpose_21/strided_slice/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_21/strided_slice/stack_1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_21/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_21/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_21/strided_slice", "StatefulPartitionedCall/sequential_6/conv2d_transpose_21/stack/1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_21/stack/2", "StatefulPartitionedCall/sequential_6/conv2d_transpose_21/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_21/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_21/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_21/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/sequential_6/reshape_3/Reshape"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_22/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_21/conv2d_transpose", "StatefulPartitionedCall/sequential_6/batch_normalization_22/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_22/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_22/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_6/batch_normalization_22/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/leaky_re_lu_40/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_22/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_22/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_6/leaky_re_lu_40/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_22/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_22/Shape", "StatefulPartitionedCall/sequential_6/conv2d_transpose_22/strided_slice/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_22/strided_slice/stack_1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_22/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_22/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_22/strided_slice", "StatefulPartitionedCall/sequential_6/conv2d_transpose_22/stack/1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_22/stack/2", "StatefulPartitionedCall/sequential_6/conv2d_transpose_22/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_22/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_22/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_22/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/sequential_6/leaky_re_lu_40/LeakyRelu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_23/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_22/conv2d_transpose", "StatefulPartitionedCall/sequential_6/batch_normalization_23/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_23/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_23/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_6/batch_normalization_23/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/leaky_re_lu_41/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_23/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_23/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_6/leaky_re_lu_41/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_23/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_23/Shape", "StatefulPartitionedCall/sequential_6/conv2d_transpose_23/strided_slice/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_23/strided_slice/stack_1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_23/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_23/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_23/strided_slice", "StatefulPartitionedCall/sequential_6/conv2d_transpose_23/stack/1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_23/stack/2", "StatefulPartitionedCall/sequential_6/conv2d_transpose_23/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_23/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_23/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_23/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/sequential_6/leaky_re_lu_41/LeakyRelu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_24/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_23/conv2d_transpose", "StatefulPartitionedCall/sequential_6/batch_normalization_24/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_24/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_24/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_6/batch_normalization_24/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/leaky_re_lu_42/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_24/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_24/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_6/leaky_re_lu_42/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_24/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_24/Shape", "StatefulPartitionedCall/sequential_6/conv2d_transpose_24/strided_slice/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_24/strided_slice/stack_1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_24/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_24/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_24/strided_slice", "StatefulPartitionedCall/sequential_6/conv2d_transpose_24/stack/1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_24/stack/2", "StatefulPartitionedCall/sequential_6/conv2d_transpose_24/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_24/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_24/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_24/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/sequential_6/leaky_re_lu_42/LeakyRelu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_25/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_24/conv2d_transpose", "StatefulPartitionedCall/sequential_6/batch_normalization_25/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_25/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_25/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_6/batch_normalization_25/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/leaky_re_lu_43/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_25/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_25/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_6/leaky_re_lu_43/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_25/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_25/Shape", "StatefulPartitionedCall/sequential_6/conv2d_transpose_25/strided_slice/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_25/strided_slice/stack_1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_25/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_25/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_25/strided_slice", "StatefulPartitionedCall/sequential_6/conv2d_transpose_25/stack/1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_25/stack/2", "StatefulPartitionedCall/sequential_6/conv2d_transpose_25/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_25/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_25/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_25/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/sequential_6/leaky_re_lu_43/LeakyRelu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_26/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_25/conv2d_transpose", "StatefulPartitionedCall/sequential_6/batch_normalization_26/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_26/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_26/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_6/batch_normalization_26/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/leaky_re_lu_44/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_26/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_26/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_6/leaky_re_lu_44/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_26/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_26/Shape", "StatefulPartitionedCall/sequential_6/conv2d_transpose_26/strided_slice/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_26/strided_slice/stack_1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_26/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_26/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_26/strided_slice", "StatefulPartitionedCall/sequential_6/conv2d_transpose_26/stack/1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_26/stack/2", "StatefulPartitionedCall/sequential_6/conv2d_transpose_26/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_26/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_26/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_26/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/sequential_6/leaky_re_lu_44/LeakyRelu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_27/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_26/conv2d_transpose", "StatefulPartitionedCall/sequential_6/batch_normalization_27/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_27/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_27/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_6/batch_normalization_27/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/leaky_re_lu_45/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential_6/batch_normalization_27/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_27/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_6/leaky_re_lu_45/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_27/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_27/Shape", "StatefulPartitionedCall/sequential_6/conv2d_transpose_27/strided_slice/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_27/strided_slice/stack_1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_27/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_27/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_27/strided_slice", "StatefulPartitionedCall/sequential_6/conv2d_transpose_27/stack/1", "StatefulPartitionedCall/sequential_6/conv2d_transpose_27/stack/2", "StatefulPartitionedCall/sequential_6/conv2d_transpose_27/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_27/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_27/stack", "StatefulPartitionedCall/sequential_6/conv2d_transpose_27/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/sequential_6/leaky_re_lu_45/LeakyRelu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_27/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_27/conv2d_transpose"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_6/conv2d_transpose_27/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 561}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_27/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_27/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_27/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_27/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_27/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_27/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_27/conv2d_transpose/ReadVariableOp", "shape": [5, 5, 1, 8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_26/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_26/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_26/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_26/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_26/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_26/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_26/conv2d_transpose/ReadVariableOp", "shape": [5, 5, 8, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_25/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_25/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_25/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_25/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_25/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_25/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_25/conv2d_transpose/ReadVariableOp", "shape": [5, 5, 16, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_24/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_24/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_24/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_24/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_24/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_24/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_24/conv2d_transpose/ReadVariableOp", "shape": [5, 5, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_23/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_23/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_23/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_23/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_23/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_23/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_23/conv2d_transpose/ReadVariableOp", "shape": [5, 5, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_22/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_22/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_22/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_22/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_22/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_22/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_22/conv2d_transpose/ReadVariableOp", "shape": [5, 5, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_21/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_21/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_21/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_21/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_21/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_21/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/conv2d_transpose_21/conv2d_transpose/ReadVariableOp", "shape": [5, 5, 256, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_6/dense_6/MatMul/ReadVariableOp", "shape": [2, 16384], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_21/batchnorm/mul", "shape": [16384], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_21/batchnorm/sub", "shape": [16384], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_6/reshape_3/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/reshape_3/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/reshape_3/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/reshape_3/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/reshape_3/Reshape/shape/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/reshape_3/Reshape/shape/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_27/FusedBatchNormV3/Scaled", "shape": [8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_27/FusedBatchNormV3/Offset", "shape": [8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_26/FusedBatchNormV3/Scaled", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_26/FusedBatchNormV3/Offset", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_25/FusedBatchNormV3/Scaled", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_25/FusedBatchNormV3/Offset", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_24/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_24/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_23/FusedBatchNormV3/Scaled", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_23/FusedBatchNormV3/Offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_22/FusedBatchNormV3/Scaled", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_6/batch_normalization_22/FusedBatchNormV3/Offset", "shape": [256], "dtype": "float32"}]}]}